<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"8f2172de6ae5304c2cba2e6713d4dff19c0e4ab65bd04762ac774eab1d04ca3a","plan_job_ref":"Job Terraform checks on pull request #32 at https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/12146320075","plan_out_hash":"985922275886333a4b2d9d928241674d246b3068b3405ce86037e9859662b3ae","plan_hash":"8b62baeb2ea8353717d45acb5f3e3935ce4a57dc7b4d71fcff69660c55a602b3","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __./__
<details>
<summary>Plan: 0 to add, 12 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.repositories["sudoblark.monsternames.api"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.monsternames.api"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.monsternames.api"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.monsternames.api"
        name                        = "sudoblark.monsternames.api"
!~      visibility                  = "private" -> "public"
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.monsternames.api"].github_repository_file.gitignore will be updated in-place
!~  resource "github_repository_file" "gitignore" {
!~      content             = <<-EOT
            # Created by .ignore support plugin (hsz.mobi)
            ### Python template
            # Byte-compiled / optimized / DLL files
            __pycache__/
            *.py[cod]
            *$py.class
            
            # C extensions
            *.so
            
            # Distribution / packaging
            .Python
            env/
            build/
            develop-eggs/
            dist/
            downloads/
            eggs/
            .eggs/
            lib/
            lib64/
            parts/
            sdist/
            var/
            *.egg-info/
            .installed.cfg
            *.egg
            
            # PyInstaller
            #  Usually these files are written by a python script from a template
            #  before PyInstaller builds the exe, so as to inject date/other infos into it.
            *.manifest
            *.spec
            
            # Installer logs
            pip-log.txt
            pip-delete-this-directory.txt
            
            # Unit test / coverage reports
            htmlcov/
            .tox/
            .coverage
            .coverage.*
            .cache
            nosetests.xml
            coverage.xml
            *,cover
            .hypothesis/
            
            # Translations
            *.mo
            *.pot
            
            # Django stuff:
            *.log
            local_settings.py
            
            # Flask stuff:
            instance/
            .webassets-cache
            
            # Scrapy stuff:
            .scrapy
            
            # Sphinx documentation
            docs/_build/
            
            # PyBuilder
            target/
            
            # IPython Notebook
            .ipynb_checkpoints
            
            # pyenv
            .python-version
            
            # celery beat schedule file
            celerybeat-schedule
            
            # dotenv
            .env
            
            # virtualenv
            venv/
            ENV/
            
            # Spyder project settings
            .spyderproject
            
            # Rope project settings
            .ropeproject
            ### VirtualEnv template
            # Virtualenv
            # http://iamzed.com/2009/05/07/a-primer-on-virtualenv/
            [Bb]in
            [Ii]nclude
            [Ll]ib
            [Ll]ib64
            [Ll]ocal
            [Ss]cripts
            pyvenv.cfg
            .venv
            pip-selfcheck.json
            
            ### JetBrains template
            # Covers JetBrains IDEs: IntelliJ, RubyMine, PhpStorm, AppCode, PyCharm, CLion, Android Studio, WebStorm and Rider
            # Reference: https://intellij-support.jetbrains.com/hc/en-us/articles/206544839
            
            # User-specific stuff
            .idea/**/workspace.xml
            .idea/**/tasks.xml
            .idea/**/usage.statistics.xml
            .idea/**/dictionaries
            .idea/**/shelf
            
            # AWS User-specific
            .idea/**/aws.xml
            
            # Generated files
            .idea/**/contentModel.xml
            
            # Sensitive or high-churn files
            .idea/**/dataSources/
            .idea/**/dataSources.ids
            .idea/**/dataSources.local.xml
            .idea/**/sqlDataSources.xml
            .idea/**/dynamic.xml
            .idea/**/uiDesigner.xml
            .idea/**/dbnavigator.xml
            
            # Gradle
            .idea/**/gradle.xml
            .idea/**/libraries
            
            # Gradle and Maven with auto-import
            # When using Gradle or Maven with auto-import, you should exclude module files,
            # since they will be recreated, and may cause churn.  Uncomment if using
            # auto-import.
            # .idea/artifacts
            # .idea/compiler.xml
            # .idea/jarRepositories.xml
            # .idea/modules.xml
            # .idea/*.iml
            # .idea/modules
            # *.iml
            # *.ipr
            
            # CMake
            cmake-build-*/
            
            # Mongo Explorer plugin
            .idea/**/mongoSettings.xml
            
            # File-based project format
            *.iws
            
            # IntelliJ
            out/
            
            # mpeltonen/sbt-idea plugin
            .idea_modules/
            
            # JIRA plugin
            atlassian-ide-plugin.xml
            
            # Cursive Clojure plugin
            .idea/replstate.xml
            
            # SonarLint plugin
            .idea/sonarlint/
            
            # Crashlytics plugin (for Android Studio and IntelliJ)
            com_crashlytics_export_strings.xml
            crashlytics.properties
            crashlytics-build.properties
            fabric.properties
            
            # Editor-based Rest Client
            .idea/httpRequests
            
            # Android studio 3.1+ serialized cache file
            .idea/caches/build_file_checksums.ser
            
            # idea folder, uncomment if you don't need it
            .idea
            
            ### Terraform template
            # Local .terraform directories
            **/.terraform/*
            
            # .tfstate files
            *.tfstate
            *.tfstate.*
            
            # Crash log files
            crash.log
            crash.*.log
            
            # Exclude all .tfvars files, which are likely to contain sensitive data, such as
            # password, private keys, and other secrets. These should not be part of version
            # control as they are data points which are potentially sensitive and subject
            # to change depending on the environment.
            *.tfvars
            *.tfvars.json
            
            # Ignore override files as they are usually used to override resources locally and so
            # are not checked in
            override.tf
            override.tf.json
            *_override.tf
            *_override.tf.json
            
            # Include override files you do wish to add to version control using negated pattern
            # !example_override.tf
            
            # Include tfplan files to ignore the plan output of command: terraform plan -out=tfplan
            # example: *tfplan*
            
            # Ignore CLI configuration files
            .terraformrc
            terraform.rc
            # Lock file automatically managed by Terraform
            **/.terraform.lock.hcl
            
            # PyTest
            **/.pytest_cache
            .vscode/settings.json
            
            # MacOS
            .DS_Store
            .ado/templates/query_status.json
            
            # Temp dev files
            dev_scratchpad/*
          - 
          - # Lambda zip files meant to be created by pipelines
          - **/lambda.zip
        EOT
        id                  = "sudoblark.monsternames.api/.gitignore"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.monsternames.api"].github_repository_file.precommit will be updated in-place
!~  resource "github_repository_file" "precommit" {
!~      content             = <<-EOT
          - fail_fast: true
          - default_stages: [commit]
          - repos:
          -   - repo: https://github.com/pre-commit/pre-commit-hooks
          -     rev: v4.5.0
          -     hooks:
          -       - id: check-ast
          -       - id: check-added-large-files
          -       - id: check-case-conflict
          -       - id: check-shebang-scripts-are-executable
          -       - id: check-merge-conflict
          -       - id: detect-private-key
          -       - id: debug-statements
          -       - id: detect-aws-credentials
          -         args:
          -           - --allow-missing-credentials
          -       - id: mixed-line-ending
          -       - id: trailing-whitespace
          -   - repo: https://github.com/bridgecrewio/checkov.git
          -     rev: 3.2.50
          -     hooks:
          -       - id: checkov
          -         verbose: false
          -         args: [--soft-fail]
          -   - repo: https://github.com/antonbabenko/pre-commit-terraform
          -     rev: v1.94.3
          -     hooks:
          -       - id: terraform_fmt
          -       - id: terraform_validate
          + 
        EOT
        id                  = "sudoblark.monsternames.api/.pre-commit-config.yaml"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.api_gateway"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.api_gateway"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.api_gateway"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.api_gateway"
        name                        = "sudoblark.terraform.module.aws.api_gateway"
-       vulnerability_alerts        = true -> null
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.elastic_container_registry"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.elastic_container_registry"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.elastic_container_registry"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.elastic_container_registry"
        name                        = "sudoblark.terraform.module.aws.elastic_container_registry"
-       vulnerability_alerts        = true -> null
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.event_bridge_rule"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.event_bridge_rule"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.event_bridge_rule"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.event_bridge_rule"
        name                        = "sudoblark.terraform.module.aws.event_bridge_rule"
-       vulnerability_alerts        = true -> null
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.iam_role"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.iam_role"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.iam_role"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.iam_role"
        name                        = "sudoblark.terraform.module.aws.iam_role"
-       vulnerability_alerts        = true -> null
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.lambda"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.lambda"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.lambda"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.lambda"
        name                        = "sudoblark.terraform.module.aws.lambda"
-       vulnerability_alerts        = true -> null
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.s3_bucket"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.s3_bucket"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.s3_bucket"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.s3_bucket"
        name                        = "sudoblark.terraform.module.aws.s3_bucket"
-       vulnerability_alerts        = true -> null
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.s3_bucket_notifications"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.s3_bucket_notifications"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.s3_bucket_notifications"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.s3_bucket_notifications"
        name                        = "sudoblark.terraform.module.aws.s3_bucket_notifications"
-       vulnerability_alerts        = true -> null
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.security_group"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.security_group"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.security_group"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.security_group"
        name                        = "sudoblark.terraform.module.aws.security_group"
-       vulnerability_alerts        = true -> null
#        (31 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.module.aws.state_machine"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.terraform.module.aws.state_machine"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.terraform.module.aws.state_machine"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.terraform.module.aws.state_machine"
        name                        = "sudoblark.terraform.module.aws.state_machine"
-       vulnerability_alerts        = true -> null
#        (31 unchanged attributes hidden)
    }

Plan: 0 to add, 12 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform checks on pull request #32](https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/12146320075)